//자료구조
//- 자료구조는 컴퓨터가 데이터를 효율적으로 다룰 수 있게 도와주는
//	 데이터 보관 방법과 연산의 총체를 의미한다.

//- 예를 들어 int도 자료구조이다.
//int는 32bit메모리 공간에 수를 할당하되 첫 비트를 부호 표현에 사용하는 등의
//'보관 방법'을 정의하고 있고, 덧셈/뺄셈/나눗셈/곱셈/논리/시프트 등
//다양한 '연산' 또한 정의하고 있다.

//자료구조의 종류
//- 단순 자료구조
	//- 기본 데이터 형식
//- 복합 자료구조
	//- 선형 자료 구조
		//- 데이터 요소를 순차적으로 연결하는 자료 구조로 구현하기 쉽고 사용하기도 쉽다.
		//- 배열(Array), 리스트(List), 스택(Stack), 큐(Queue)가 있다.
		//- 비선형자료구조
			//- 데이터를 비-순차적으로 연결한다.
			//- 한 데이터 요소에서 여러 데이터 요소로 연결되기도 하고, 여러 데이터 요소에서 하나의 데이터 요소로 연결되기도 한다.
			//- 트리(Tree),그래프(Graph)가 존재한다.

//자료 구조를 공부해야 하는 이유
//데이터를 효율적으로 사용할 수 있게 도와주는 핵심 부품 역할을 한다.
